# Fabrication Part Get All Fabrication Double Wall Connector Definitions Method

Source: https://www.revitapidocs.com/2026/45aa54c1-6aaf-f239-2891-a57ef35c0ef2.htm

---

| Fabrication Part Get All Fabrication Double Wall Connector Definitions Method |
| --- |

Gets all connectors that are valid to be assigned to the part for a specified double wall connector
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<int> GetAllFabricationDoubleWallConnectorDefinitions(
	Connector connector
)
```

```
Public Function GetAllFabricationDoubleWallConnectorDefinitions (
	connector As Connector
) As IList(Of Integer)
```

```
public:
IList<int>^ GetAllFabricationDoubleWallConnectorDefinitions(
	Connector^ connector
)
```

```
member GetAllFabricationDoubleWallConnectorDefinitions :
        connector : Connector -> IList<int>
```

#### Parameters

connector Connector
:   The connector to to check against

#### Return Value

IList Int32
Returns an array of connector database identifiers Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

FabricationPart Class Autodesk.Revit.DB Namespace